{"url": "https://api.github.com/repos/mozilla-l10n/documentation/pulls/comments/108736077", "pull_request_review_id": 29784590, "id": 108736077, "diff_hunk": "@@ -0,0 +1,88 @@\n+# Working with a Localization Agency\n+\n+This document is a guideline for project manager who interacts with a localization agency that is already vetted.\n+\n+## Make it official\n+\n+A series of activities need to happen before an l10n project can start.\n+\n+* A signed master service agreement between Mozilla and the vendor. Person signed on Mozilla side could be the PM or PM’s manager.\n+* Account Payable form that contains banking information, billing cycle (monthly, quarterly or as soon as) and payment terms (within 30 or 45 days); billing email address.\n+* An official rate sheet that includes the following but not limited to:\n+** Word rate for each of the interested locales as in new words, 100% match, fuzzy match for translation, review, proofreading\n+** Hourly rate: engineering, QA and testing, PM rate\n+** Minimum charge for a project and the thresholds by number of words per locale\n+** Rush rate\n+\n+PO, or Purchase Order, may or may not be necessary in order to get vendor service. Some teams have ongoing need for l10n service and have a budget set aside annually. This is a good reason to have a PO established. For most projects that are one time need, or sporadic, it’s best to go without a PO, and bill to the serviced department as needed.\n+\n+## Key contacts and responsibilities:\n+\n+** Account Manager: relationship, escalation of issues; complaints about quality or deadlines\n+** Project Manager: handles day to day operation. Coordinates resources on the agency side; provides estimate of a project's deadline and cost\n+** Account Payable Manager: sends the bill to Mozilla Account Payable\n+\n+## Set up accounts:\n+\n+Depending on the needs and where the source file can be accessed, it’s good to have an account set up in the following places:\n+\n+* GitHub: usually for content heavy type of projects, such as legal document; can commit directly\n+* Pontoon: as translator when there is no community; or no account when there is an existing community (the vendor will provide suggestions only, the community will approve them)\n+* Pootle: as translator when there is no community; or no account when there is an existing community (the vendor will provide suggestions only, the community will approve them)\n+* Bugzilla: inform which product group l10n bugs are under\n+* Google drive: to view, review, and translate directly\n+* If WordPress platform is used, sign up an account. It’s project specific\n+\n+Once accounts are set up, allow the agency to explore the tools, flows and the product features to familiarize itself before actual work starts. Setting up a meeting to share your screen might be a good idea, and use this opportunity to answer their questions about the project or the tools.\n+\n+## Localizing a project\n+\n+### Planning:\n+\n+Once outsourcing is a necessity for a project, before reaching out to the l10n agency to make an official requests, make sure to check the following:\n+\n+* Required languages\n+* Scope of work: other than translation; review; testing\n+* Milestones and Deadline: negotiate it so the agency has sufficient time to finish each of the required task, and the community has enough time to review and sign off.\n+* Check with communities to get their buy-ins on languages to outsource and tasks to divide among the contributing parties\n+\n+#### Communications:\n+\n+* Get a quote from the agency\n+* Make sure both agency and the community have the proper access to the l10n tool or platform where the localizable content is staged and roles properly assigned per agreement\n+* Share with agency locale specific style guides and product specific term list. Always refer to transivision.mozfr.org", "path": "misc/working_w_l10n_agency.md", "position": null, "original_position": 53, "commit_id": "426cb31062d1a54d1b0bff64d6c124dc2ac47249", "original_commit_id": "982d1d4f0ea030370b2f7cf5e681d3e621d8971f", "user": {"login": "flodolo", "id": 3644868, "avatar_url": "https://avatars0.githubusercontent.com/u/3644868?v=4", "gravatar_id": "", "url": "https://api.github.com/users/flodolo", "html_url": "https://github.com/flodolo", "followers_url": "https://api.github.com/users/flodolo/followers", "following_url": "https://api.github.com/users/flodolo/following{/other_user}", "gists_url": "https://api.github.com/users/flodolo/gists{/gist_id}", "starred_url": "https://api.github.com/users/flodolo/starred{/owner}{/repo}", "subscriptions_url": "https://api.github.com/users/flodolo/subscriptions", "organizations_url": "https://api.github.com/users/flodolo/orgs", "repos_url": "https://api.github.com/users/flodolo/repos", "events_url": "https://api.github.com/users/flodolo/events{/privacy}", "received_events_url": "https://api.github.com/users/flodolo/received_events", "type": "User", "site_admin": false}, "body": "Typo in the name, put a real link to Transvision", "created_at": "2017-03-29T17:23:32Z", "updated_at": "2017-08-08T17:31:58Z", "html_url": "https://github.com/mozilla-l10n/documentation/pull/77#discussion_r108736077", "pull_request_url": "https://api.github.com/repos/mozilla-l10n/documentation/pulls/77", "author_association": "COLLABORATOR", "_links": {"self": {"href": "https://api.github.com/repos/mozilla-l10n/documentation/pulls/comments/108736077"}, "html": {"href": "https://github.com/mozilla-l10n/documentation/pull/77#discussion_r108736077"}, "pull_request": {"href": "https://api.github.com/repos/mozilla-l10n/documentation/pulls/77"}}, "body_html": "<p>Typo in the name, put a real link to Transvision</p>", "body_text": "Typo in the name, put a real link to Transvision"}