{"url": "https://api.github.com/repos/mozilla-l10n/documentation/pulls/comments/130578248", "pull_request_review_id": 53465946, "id": 130578248, "diff_hunk": "@@ -0,0 +1,109 @@\n+# Working with a Localization Agency\n+\n+This document is a guideline for project manager who interacts with a localization agency that is already vetted.\n+\n+## Initial set up before sending localization requests\n+\n+### Ask for a rate sheet\n+\n+* Make sure you have received a rate sheet customized for Mozilla needs. This should have been sent as part of the vetting process, and it can be updated annually. An example of the official [rate sheet](https://drive.google.com/a/mozilla.com/file/d/0B7u_NzvpgGcgTDhoVFBsN3dMc0E/view?usp=sharing) that includes the following but not limited to:\n+  * Word rate for each of the interested locales as in new words, 100% match, fuzzy match for translation, review, proofreading\n+  * Hourly rate: engineering, QA and testing, PM rate.\n+  * Minimum charge for a project and the thresholds by number of words per locale.\n+  * Rush rate.\n+\n+### Do the initial paperwork\n+\n+A series of activities need to happen before an l10n project can start. The first step is doing the paperwork to be able to receive quotes for projects and pay bills for requests.\n+\n+Unless there are changes in the signed document, this step is done once, for the whole organization, and only at the beginning of relationship engagement.\n+\n+* A master service agreement (or MSA) has to be signed between Mozilla and the vendor. The person signing on Mozilla side could be the PM or PM’s manager. This document shows the conditions that the contract is operated in between the service provider and Mozilla. Without this agreement, a service can’t start. Here is an example of [MSA](https://drive.google.com/a/mozilla.com/file/d/0B7u_NzvpgGcgSW5Jend3TlpyRlE/view?usp=sharing).\n+* An Account Payable (or AP) form has to be filled. It contains banking information, billing cycle (monthly, quarterly, or “as soon as”) and payment due terms (within 30 or 45 days); billing email address. Here is an example of [AP form](https://drive.google.com/a/mozilla.com/file/d/0B7u_NzvpgGcgYmN6c0tJc2IwUzA/view?usp=sharing).\n+\n+PO, or Purchase Order, may or may not be necessary in order to get vendor service. Some teams have ongoing need for l10n service and have a budget set aside annually. This is a good reason to have a PO established. For most projects that are one time need, or sporadic, it’s best to go without a PO, and bill to the serviced department as needed.\n+\n+### Set up accounts\n+\n+Depending on the needs and where the source file can be accessed, it’s good to have an account set up for the vendor’s project manager in the following places:\n+\n+* Pontoon: set up a “translator” account when there is no community; or a basic “contributor” account when a community exists so that the vendor provides suggestions and the community review them.\n+* Bugzilla: so that the vendor’s project manager can interact in bugs. Bugzilla will allow us to have a central place to post project details and updates. Communication is generally handled via email with the vendor, but it’s useful to have a bug number to reference to, and the vendor can use the bug to quickly access all the details.\n+* Google Drive: create a shared folder for the vendor to view, review, and translate directly spreadsheets or Google Docs.\n+* GitHub: give commit permission if they need to commit directly in a repository (e.g. [Legal docs](https://github.com/mozilla/legal-docs/))\n+\n+Note: Additional account setup may be needed if the project does not support our localization process (e.g. Wordpress).", "path": "misc/working_w_l10n_agency.md", "position": null, "original_position": 35, "commit_id": "426cb31062d1a54d1b0bff64d6c124dc2ac47249", "original_commit_id": "b33692a27e5975c79bfa969fd6ab46a931e598cb", "user": {"login": "flodolo", "id": 3644868, "avatar_url": "https://avatars0.githubusercontent.com/u/3644868?v=4", "gravatar_id": "", "url": "https://api.github.com/users/flodolo", "html_url": "https://github.com/flodolo", "followers_url": "https://api.github.com/users/flodolo/followers", "following_url": "https://api.github.com/users/flodolo/following{/other_user}", "gists_url": "https://api.github.com/users/flodolo/gists{/gist_id}", "starred_url": "https://api.github.com/users/flodolo/starred{/owner}{/repo}", "subscriptions_url": "https://api.github.com/users/flodolo/subscriptions", "organizations_url": "https://api.github.com/users/flodolo/orgs", "repos_url": "https://api.github.com/users/flodolo/repos", "events_url": "https://api.github.com/users/flodolo/events{/privacy}", "received_events_url": "https://api.github.com/users/flodolo/received_events", "type": "User", "site_admin": false}, "body": "nits: additional (lowercase), WordPress.", "created_at": "2017-08-01T11:00:49Z", "updated_at": "2017-08-08T17:31:58Z", "html_url": "https://github.com/mozilla-l10n/documentation/pull/77#discussion_r130578248", "pull_request_url": "https://api.github.com/repos/mozilla-l10n/documentation/pulls/77", "author_association": "COLLABORATOR", "_links": {"self": {"href": "https://api.github.com/repos/mozilla-l10n/documentation/pulls/comments/130578248"}, "html": {"href": "https://github.com/mozilla-l10n/documentation/pull/77#discussion_r130578248"}, "pull_request": {"href": "https://api.github.com/repos/mozilla-l10n/documentation/pulls/77"}}, "body_html": "<p>nits: additional (lowercase), WordPress.</p>", "body_text": "nits: additional (lowercase), WordPress."}